service-zhwg-ywkt-mtosi-master/template/烽火/request/measureRoundTripDelay-宿.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/rtm/xsd/mc/v1" xmlns:v12="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
   <soapenv:Header>
      <v1:header>
      <v1:security>admin:admin</v1:security>
<v1:communicationStyle>RPC</v1:communicationStyle>
<v1:communicationPattern>SimpleResponse</v1:communicationPattern>
      </v1:header>
   </soapenv:Header>
   <soapenv:Body>
      <v11:measureRoundTripDelayRequest>
         <!--Optional:-->
         <v11:tpName>
            <!--Zero or more repetitions:-->
            <v12:rdn>
               <v12:type>MD</v12:type>
               <v12:value>1</v12:value>
            </v12:rdn>
                      <v12:rdn>
               <v12:type>ME</v12:type>
               <v12:value>7e37eb46-28ed-49d2-b6bd-1254ddfce272</v12:value>
            </v12:rdn>
                      <v12:rdn>
               <v12:type>PTP</v12:type>
               <v12:value>/rack=1/shelf=1/slot=34/port=5</v12:value>
            </v12:rdn>
                      <v12:rdn>
               <v12:type>CTP</v12:type>
               <v12:value>/och=1/odu2=1</v12:value>
            </v12:rdn>
         </v11:tpName>
         <!--Optional:-->
         <v11:role>Loopback</v11:role>
         <!--Optional:-->
         <v11:type>PM</v11:type>
      </v11:measureRoundTripDelayRequest>
   </soapenv:Body>
</soapenv:Envelope>